tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "romkatv/powerlevel10k"
cask "xquartz"

brew "powerlevel10k"

brew "svn"
brew "chezmoi"
brew "automake"
brew "sqlite"
brew "bash-completion"
brew "docker-clean"
brew "git"
brew "dos2unix"
brew "editorconfig"
brew "fd"
brew "hub"
brew "imagemagick"
brew "ispell"
brew "mas"

brew "pandoc"

brew "python"

brew "ripgrep"
brew "ruby"
brew "sl"
brew "ssh-copy-id"
brew "swi-prolog"
brew "tig"
brew "wget"
brew "cmatrix"

brew "zsh"
brew "zsh-completions"

brew "railwaycat/emacsmacport/emacs-mac", args: ["with-emacs-sexy-icon", "with-starter"]

cask "atom"
cask "1password"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "opera"
cask "slack"
cask "spotify"
cask "spectacle"
cask "google-chrome-canary"
cask "choosy"
cask "raycast"

cask "font-andale-mono"
cask "font-cutive-mono"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "font-meslo-for-powerline"

mas "Color Picker", id: 641027709
mas "DaisyDisk", id: 411643860
mas "The Unarchiver", id: 425424353
mas "WiFi Signal", id: 525912054
mas "WhatsApp", id: 1147396723
