# Homebrew Bundle File
# Install with: brew bundle --file=.Brewfile

# Taps
tap "railwaycat/emacsmacport"

# System Dependencies
cask "xquartz"
brew "mas"

# Version Control & Development Tools
brew "git"
brew "gh"
brew "svn"
brew "just"

# Programming Languages & Runtimes
brew "python"
brew "ruby"
brew "node"
brew "yarn"
brew "rust"
brew "go"

# Modern CLI Tools
brew "starship"
brew "ripgrep"
brew "bat"
brew "htop"
brew "tree"
brew "fzf"
brew "tldr"
brew "uv"
brew "jq"
brew "fd"

# Classic CLI Tools
brew "wget"
brew "ssh-copy-id"
brew "tig"

# Text Processing & Documentation
brew "pandoc"
cask "mactex"
brew "dos2unix"
brew "editorconfig"

# Spell Checking
brew "aspell"
brew "hunspell"
brew "ispell"

# Build Tools & System Utils
brew "automake"
brew "sqlite"
brew "imagemagick"

# Shell & Terminal
brew "zsh"
brew "zsh-completions"

# Fun Stuff
brew "sl"
brew "cmatrix"

# Containerization
brew "docker"
brew "docker-compose"
cask "orbstack"

# Editors & IDEs
cask "railwaycat/emacsmacport/emacs-mac"
cask "visual-studio-code"

# Browsers
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "google-chrome@canary"
cask "arc"
cask "opera"
cask "floorp"
cask "choosy"
cask "brave-browser"
cask "orion"

# Terminal & System Tools
cask "ghostty"
cask "iterm2"
cask "karabiner-elements"
cask "alfred"

# Media & Communication
cask "spotify"
cask "whatsapp"
cask "iina"

# AI
cask "Claude"
cask "ChatGPT"

# Fonts
cask "font-andale-mono"
cask "font-cutive-mono"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "font-meslo-for-powerline"

# Mac App Store Apps
mas "DaisyDisk", id: 411643860
mas "The Unarchiver", id: 425424353
mas "Consent-O-Matic", id: 1606897889
