tap "homebrew/bundle"
tap "railwaycat/emacsmacport"

cask "railwaycat/emacsmacport/emacs-mac"

cask "xquartz"

brew "svn"
brew "automake"
brew "sqlite"
brew "git"
brew "dos2unix"
brew "editorconfig"
brew "fd"
brew "imagemagick"
brew "ispell"
brew "mas"
brew "starship"
brew "wkhtmltopdf"

brew "pandoc"

brew "python"

brew "ripgrep"
brew "ruby"
brew "sl"
brew "ssh-copy-id"
brew "tig"
brew "wget"
brew "cmatrix"

brew "zsh"
brew "zsh-completions"

cask "ghostty"
cask "atom"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "opera"
cask "spotify"
cask "spectacle"
cask "google-chrome@canary"
cask "choosy"
cask "floorp"
cask "alfred"
cask "whatsapp"

cask "font-andale-mono"
cask "font-cutive-mono"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-inconsolata"
cask "font-input"
cask "font-source-code-pro"
cask "font-ubuntu"
cask "font-meslo-for-powerline"

mas "DaisyDisk", id: 411643860
mas "The Unarchiver", id: 425424353
mas "WiFi Signal", id: 525912054
mas "Consent-O-Matic" id: 1606897889
